---
kind: type
id: T:Autodesk.Revit.DB.ConnectorDomainType
source: html/4f9ca54b-91bc-51c2-8ad1-3b0808631c83.htm
---
# Autodesk.Revit.DB.ConnectorDomainType

Type of connector domain.

## Syntax (C#)
```csharp
public enum ConnectorDomainType
```